squareTube_RSM/system/controlDict
 /*--------------------------------*- C++ -*----------------------------------*\
  | =========                 |                                                 |
  | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
  |  \\    /   O peration     | Version:  v13                                   |
  |   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
  |    \\/     M anipulation  |                                                 |
  \*---------------------------------------------------------------------------*/
  FoamFile
  {
      version     2.0;
      format      ascii;
      class       dictionary;
      object      controlDict;
  }
  // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

  application     simpleFoam;

  startFrom       startTime;

  startTime       0;

  stopAt          endTime;

  endTime         1000;

  deltaT          1;

  writeControl    timeStep;

  writeInterval   100;

  purgeWrite      0;

  writeFormat     ascii;

  writePrecision  6;

  writeCompression off;

  timeFormat      general;

  timePrecision   6;

  runTimeModifiable true;

