squareTube_RSM/0/p
 /*--------------------------------*- C++ -*----------------------------------*\
  | =========                 |                                                 |
  | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
  |  \\    /   O peration     | Version:  v13                                   |
  |   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
  |    \\/     M anipulation  |                                                 |
  \*---------------------------------------------------------------------------*/
  FoamFile
  {
      version     2.0;
      format      ascii;
      class       volScalarField;
      object      p;
  }
  // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

  dimensions      [0 2 -2 0 0 0 0];  // m^2/s^2 (kinematic pressure)

  internalField   uniform 0;

  boundaryField
  {
      inlet
      {
          type            zeroGradient;
      }

      outlet
      {
          type            fixedValue;
          value           uniform 0;
      }

      walls
      {
          type            zeroGradient;
      }
  }

  // ************************************************************************* //

