squareTube_RSM/0/epsilon
 /*--------------------------------*- C++ -*----------------------------------*\
  | =========                 |                                                 |
  | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
  |  \\    /   O peration     | Version:  v13                                   |
  |   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
  |    \\/     M anipulation  |                                                 |
  \*---------------------------------------------------------------------------*/
  FoamFile
  {
      version     2.0;
      format      ascii;
      class       volScalarField;
      object      epsilon;
  }
  // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

  dimensions      [0 2 -3 0 0 0 0];  // m^2/s^3

  internalField   uniform 0.133;

  boundaryField
  {
      inlet
      {
          type            fixedValue;
          value           uniform 0.133;
      }

      outlet
      {
          type            zeroGradient;
      }

      walls
      {
          type            epsilonWallFunction;
          value           uniform 0.133;
      }
  }

  // ************************************************************************* //

