squareTube_RSM/system/fvSchemes
  /*--------------------------------*- C++ -*----------------------------------*\
  | =========                 |                                                 |
  | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
  |  \\    /   O peration     | Version:  v13                                   |
  |   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
  |    \\/     M anipulation  |                                                 |
  \*---------------------------------------------------------------------------*/
  FoamFile
  {
      version     2.0;
      format      ascii;
      class       dictionary;
      object      fvSchemes;
  }
  // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

  ddtSchemes
  {
      default         steadyState;
  }

  gradSchemes
  {
      default         Gauss linear;
  }

  divSchemes
  {
      default         none;

      div(phi,U)      bounded Gauss upwind;
      div(phi,R)      bounded Gauss upwind;
      div(phi,k)      bounded Gauss upwind;
      div(phi,epsilon) bounded Gauss upwind;
      div((nuEff*dev2(T(grad(U))))) Gauss linear;
  }

  laplacianSchemes
  {
      default         Gauss linear corrected;
  }

  interpolationSchemes
  {
      default         linear;
  }

  snGradSchemes
  {
      default         corrected;
  }

  wallDist
  {
      method          meshWave;
  }


  // ************************************************************************* //

